[{"backend":"oneflow","class_name":"Model","config":{"input_layers":[],"layers":[{"class_name":"system_op","config":{"device_tag":"cpu","name":"Return_23","return_conf":{"in":"dense2-bias_add/out_0","out":"out"},"scope_symbol_id":"4611686018427535358"},"inbound_nodes":["dense2-bias_add"],"name":"Return_23"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_tag":"gpu","dilation_rate":[1,1],"filters":64,"groups":1,"kernel_size":[5,5],"name":"conv2","padding_before":[2,2],"scope_symbol_id":"4611686018427514878","strides":[1,1]},"inbound_nodes":["pool1","conv2-weight"],"name":"conv2"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"constant_conf":{"value":0.0}},"model_name":"bias","name":"conv2-bias","out":"out","scope_symbol_id":"4611686018427523070","shape":["64"],"trainable":true},"inbound_nodes":[],"name":"conv2-bias"},{"class_name":"system_op","config":{"device_tag":"gpu","input_conf":{"blob_conf":{"data_type":"kFloat","is_dynamic":false,"parallel_distribution":{"sbp_parallel":[{"split_parallel":{"axis":"0"}}]},"shape":{"dim":["100","1","28","28"]}},"out":"out"},"name":"Input_21","scope_symbol_id":"4611686018427510782"},"inbound_nodes":[],"name":"Input_21"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"constant_conf":{"value":0.0}},"model_name":"bias","name":"dense1-bias","out":"out","parallel_distribution":["B"],"scope_symbol_id":"4611686018427527166","shape":["512"],"trainable":true},"inbound_nodes":[],"name":"dense1-bias"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"truncated_normal_conf":{"std":0.10000000149011612}},"model_name":"weight","name":"conv2-weight","out":"out","scope_symbol_id":"4611686018427523070","shape":["64","32","5","5"],"trainable":true},"inbound_nodes":[],"name":"conv2-weight"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"truncated_normal_conf":{"std":0.10000000149011612}},"model_name":"weight","name":"dense2-weight","out":"out","parallel_distribution":["B"],"scope_symbol_id":"4611686018427531262","shape":["10","512"],"trainable":true},"inbound_nodes":[],"name":"dense2-weight"},{"class_name":"relu","config":{"device_tag":"gpu","name":"conv1-activation","scope_symbol_id":"4611686018427518974"},"inbound_nodes":["conv1-bias_add"],"name":"conv1-activation"},{"class_name":"bias_add","config":{"axis":1,"device_tag":"gpu","name":"conv1-bias_add","scope_symbol_id":"4611686018427518974"},"inbound_nodes":["conv1-bias","conv1"],"name":"conv1-bias_add"},{"class_name":"bias_add","config":{"axis":1,"device_tag":"gpu","name":"dense1-bias_add","scope_symbol_id":"4611686018427527166"},"inbound_nodes":["dense1-bias","dense1-matmul"],"name":"dense1-bias_add"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"constant_conf":{"value":0.0}},"model_name":"bias","name":"conv1-bias","out":"out","scope_symbol_id":"4611686018427518974","shape":["32"],"trainable":true},"inbound_nodes":[],"name":"conv1-bias"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_tag":"gpu","dilation_rate":[1,1],"filters":32,"groups":1,"kernel_size":[5,5],"name":"conv1","padding_before":[2,2],"scope_symbol_id":"4611686018427514878","strides":[1,1]},"inbound_nodes":["conv1-weight","Input_21"],"name":"conv1"},{"class_name":"max_pool_2d","config":{"ceil_mode":false,"data_format":"channels_first","device_tag":"gpu","name":"pool1","padding":"same_lower","padding_after":[0,0],"padding_before":[0,0],"pool_size":[2,2],"scope_symbol_id":"4611686018427514878","strides":[2,2]},"inbound_nodes":["conv1-activation"],"name":"pool1"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"truncated_normal_conf":{"std":0.10000000149011612}},"model_name":"weight","name":"conv1-weight","out":"out","scope_symbol_id":"4611686018427518974","shape":["32","1","5","5"],"trainable":true},"inbound_nodes":[],"name":"conv1-weight"},{"class_name":"bias_add","config":{"axis":1,"device_tag":"gpu","name":"conv2-bias_add","scope_symbol_id":"4611686018427523070"},"inbound_nodes":["conv2","conv2-bias"],"name":"conv2-bias_add"},{"class_name":"bias_add","config":{"axis":1,"device_tag":"gpu","name":"dense2-bias_add","scope_symbol_id":"4611686018427531262"},"inbound_nodes":["dense2-bias","dense2-matmul"],"name":"dense2-bias_add"},{"class_name":"matmul","config":{"alpha":1.0,"device_tag":"gpu","name":"dense2-matmul","scope_symbol_id":"4611686018427531262","transpose_a":false,"transpose_b":true},"inbound_nodes":["dense1-activation","dense2-weight"],"name":"dense2-matmul"},{"class_name":"relu","config":{"device_tag":"gpu","name":"conv2-activation","scope_symbol_id":"4611686018427523070"},"inbound_nodes":["conv2-bias_add"],"name":"conv2-activation"},{"class_name":"matmul","config":{"alpha":1.0,"device_tag":"gpu","name":"dense1-matmul","scope_symbol_id":"4611686018427527166","transpose_a":false,"transpose_b":true},"inbound_nodes":["dense1-weight","Reshape_22"],"name":"dense1-matmul"},{"class_name":"max_pool_2d","config":{"ceil_mode":false,"data_format":"channels_first","device_tag":"gpu","name":"pool2","padding":"same_lower","padding_after":[0,0],"padding_before":[0,0],"pool_size":[2,2],"scope_symbol_id":"4611686018427514878","strides":[2,2]},"inbound_nodes":["conv2-activation"],"name":"pool2"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"constant_conf":{"value":0.0}},"model_name":"bias","name":"dense2-bias","out":"out","parallel_distribution":["B"],"scope_symbol_id":"4611686018427531262","shape":["10"],"trainable":true},"inbound_nodes":[],"name":"dense2-bias"},{"class_name":"reshape","config":{"device_tag":"gpu","name":"Reshape_22","scope_symbol_id":"4611686018427514878","shape":["100","3136"]},"inbound_nodes":["pool2"],"name":"Reshape_22"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"truncated_normal_conf":{"std":0.10000000149011612}},"model_name":"weight","name":"dense1-weight","out":"out","parallel_distribution":["B"],"scope_symbol_id":"4611686018427527166","shape":["512","3136"],"trainable":true},"inbound_nodes":[],"name":"dense1-weight"},{"class_name":"relu","config":{"device_tag":"gpu","name":"dense1-activation","scope_symbol_id":"4611686018427527166"},"inbound_nodes":["dense1-bias_add"],"name":"dense1-activation"}],"name":"eval_job","output_layers":[]}},{"backend":"oneflow","class_name":"Model","config":{"input_layers":[],"layers":[{"class_name":"sparse_softmax_cross_entropy","config":{"depth":"10","device_tag":"gpu","name":"softmax_loss","scope_symbol_id":"4611686018427428862"},"inbound_nodes":["Input_1","dense2-bias_add"],"name":"softmax_loss"},{"class_name":"bias_add","config":{"axis":1,"device_tag":"gpu","name":"dense2-bias_add","scope_symbol_id":"4611686018427445246"},"inbound_nodes":["dense2-bias","dense2-matmul"],"name":"dense2-bias_add"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"constant_conf":{"value":0.0}},"model_name":"bias","name":"dense2-bias","out":"out","parallel_distribution":["B"],"scope_symbol_id":"4611686018427445246","shape":["10"],"trainable":true},"inbound_nodes":[],"name":"dense2-bias"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_tag":"gpu","dilation_rate":[1,1],"filters":64,"groups":1,"kernel_size":[5,5],"name":"conv2","padding_before":[2,2],"scope_symbol_id":"4611686018427428862","strides":[1,1]},"inbound_nodes":["pool1","conv2-weight"],"name":"conv2"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"constant_conf":{"value":0.0}},"model_name":"bias","name":"conv2-bias","out":"out","scope_symbol_id":"4611686018427437054","shape":["64"],"trainable":true},"inbound_nodes":[],"name":"conv2-bias"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"truncated_normal_conf":{"std":0.10000000149011612}},"model_name":"weight","name":"conv2-weight","out":"out","scope_symbol_id":"4611686018427437054","shape":["64","32","5","5"],"trainable":true},"inbound_nodes":[],"name":"conv2-weight"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"truncated_normal_conf":{"std":0.10000000149011612}},"model_name":"weight","name":"dense2-weight","out":"out","parallel_distribution":["B"],"scope_symbol_id":"4611686018427445246","shape":["10","512"],"trainable":true},"inbound_nodes":[],"name":"dense2-weight"},{"class_name":"relu","config":{"device_tag":"gpu","name":"conv1-activation","scope_symbol_id":"4611686018427432958"},"inbound_nodes":["conv1-bias_add"],"name":"conv1-activation"},{"class_name":"system_op","config":{"device_tag":"cpu","name":"Return_3","return_conf":{"in":"softmax_loss/out_0","out":"out"},"scope_symbol_id":"4611686018427457534"},"inbound_nodes":["softmax_loss"],"name":"Return_3"},{"class_name":"bias_add","config":{"axis":1,"device_tag":"gpu","name":"conv1-bias_add","scope_symbol_id":"4611686018427432958"},"inbound_nodes":["conv1-bias","conv1"],"name":"conv1-bias_add"},{"class_name":"system_op","config":{"device_tag":"gpu","input_conf":{"blob_conf":{"data_type":"kFloat","is_dynamic":false,"parallel_distribution":{"sbp_parallel":[{"split_parallel":{"axis":"0"}}]},"shape":{"dim":["100","1","28","28"]}},"out":"out"},"name":"Input_0","scope_symbol_id":"4611686018427420670"},"inbound_nodes":[],"name":"Input_0"},{"class_name":"bias_add","config":{"axis":1,"device_tag":"gpu","name":"dense1-bias_add","scope_symbol_id":"4611686018427441150"},"inbound_nodes":["dense1-bias","dense1-matmul"],"name":"dense1-bias_add"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_tag":"gpu","dilation_rate":[1,1],"filters":32,"groups":1,"kernel_size":[5,5],"name":"conv1","padding_before":[2,2],"scope_symbol_id":"4611686018427428862","strides":[1,1]},"inbound_nodes":["Input_0","conv1-weight"],"name":"conv1"},{"class_name":"max_pool_2d","config":{"ceil_mode":false,"data_format":"channels_first","device_tag":"gpu","name":"pool1","padding":"same_lower","padding_after":[0,0],"padding_before":[0,0],"pool_size":[2,2],"scope_symbol_id":"4611686018427428862","strides":[2,2]},"inbound_nodes":["conv1-activation"],"name":"pool1"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"truncated_normal_conf":{"std":0.10000000149011612}},"model_name":"weight","name":"conv1-weight","out":"out","scope_symbol_id":"4611686018427432958","shape":["32","1","5","5"],"trainable":true},"inbound_nodes":[],"name":"conv1-weight"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"constant_conf":{"value":0.0}},"model_name":"bias","name":"conv1-bias","out":"out","scope_symbol_id":"4611686018427432958","shape":["32"],"trainable":true},"inbound_nodes":[],"name":"conv1-bias"},{"class_name":"bias_add","config":{"axis":1,"device_tag":"gpu","name":"conv2-bias_add","scope_symbol_id":"4611686018427437054"},"inbound_nodes":["conv2-bias","conv2"],"name":"conv2-bias_add"},{"class_name":"matmul","config":{"alpha":1.0,"device_tag":"gpu","name":"dense2-matmul","scope_symbol_id":"4611686018427445246","transpose_a":false,"transpose_b":true},"inbound_nodes":["dense2-weight","dropout"],"name":"dense2-matmul"},{"class_name":"relu","config":{"device_tag":"gpu","name":"conv2-activation","scope_symbol_id":"4611686018427437054"},"inbound_nodes":["conv2-bias_add"],"name":"conv2-activation"},{"class_name":"matmul","config":{"alpha":1.0,"device_tag":"gpu","name":"dense1-matmul","scope_symbol_id":"4611686018427441150","transpose_a":false,"transpose_b":true},"inbound_nodes":["Reshape_2","dense1-weight"],"name":"dense1-matmul"},{"class_name":"max_pool_2d","config":{"ceil_mode":false,"data_format":"channels_first","device_tag":"gpu","name":"pool2","padding":"same_lower","padding_after":[0,0],"padding_before":[0,0],"pool_size":[2,2],"scope_symbol_id":"4611686018427428862","strides":[2,2]},"inbound_nodes":["conv2-activation"],"name":"pool2"},{"class_name":"system_op","config":{"device_tag":"gpu","input_conf":{"blob_conf":{"data_type":"kInt32","is_dynamic":false,"parallel_distribution":{"sbp_parallel":[{"split_parallel":{"axis":"0"}}]},"shape":{"dim":["100"]}},"out":"out"},"name":"Input_1","scope_symbol_id":"4611686018427420670"},"inbound_nodes":[],"name":"Input_1"},{"class_name":"reshape","config":{"device_tag":"gpu","name":"Reshape_2","scope_symbol_id":"4611686018427428862","shape":["100","3136"]},"inbound_nodes":["pool2"],"name":"Reshape_2"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"truncated_normal_conf":{"std":0.10000000149011612}},"model_name":"weight","name":"dense1-weight","out":"out","parallel_distribution":["B"],"scope_symbol_id":"4611686018427441150","shape":["512","3136"],"trainable":true},"inbound_nodes":[],"name":"dense1-weight"},{"class_name":"variable","config":{"data_type":"kFloat","device_tag":"gpu","initializer":{"constant_conf":{"value":0.0}},"model_name":"bias","name":"dense1-bias","out":"out","parallel_distribution":["B"],"scope_symbol_id":"4611686018427441150","shape":["512"],"trainable":true},"inbound_nodes":[],"name":"dense1-bias"},{"class_name":"dropout","config":{"device_tag":"gpu","name":"dropout","scale":2.0,"scope_symbol_id":"4611686018427428862"},"inbound_nodes":["dropout-dropout_random_mask_like","dense1-activation"],"name":"dropout"},{"class_name":"relu","config":{"device_tag":"gpu","name":"dense1-activation","scope_symbol_id":"4611686018427441150"},"inbound_nodes":["dense1-bias_add"],"name":"dense1-activation"},{"class_name":"random_mask_like","config":{"device_tag":"gpu","name":"dropout-dropout_random_mask_like","rate":0.5,"scope_symbol_id":"4611686018427428862","seed":"9172458435467975988"},"inbound_nodes":["dense1-activation"],"name":"dropout-dropout_random_mask_like"}],"name":"train_job","output_layers":[]}}]