[{"backend":"tsvis","class_name":"Model","config":{"input_layers":["Input_182_0","Input_183_0"],"layers":[{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt64","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_183_0","trainable":false},"inbound_nodes":[],"name":"Input_183_0"},{"class_name":"summary_write_pb","config":{"device_type":"kCPU","enable_cudnn":true,"name":"WritePb_184_0","trainable":false,"user_conf":{"input":[{"key":"step","value":{"s":["Input_183_0/out"]}},{"key":"in","value":{"s":["Input_182_0/out"]}}],"op_type_name":"summary_write_pb"}},"inbound_nodes":["Input_182_0","Input_183_0"],"name":"WritePb_184_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1000"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_182_0","trainable":false},"inbound_nodes":[],"name":"Input_182_0"}],"name":"PbJob","output_layers":[]}},{"backend":"tsvis","class_name":"Model","config":{"input_layers":["Input_185_0","Input_186_0","Input_187_0"],"layers":[{"class_name":"summary_write_image","config":{"device_type":"kCPU","enable_cudnn":true,"name":"WriteImage_188_0","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Input_185_0/out"]}},{"key":"step","value":{"s":["Input_186_0/out"]}},{"key":"tag","value":{"s":["Input_187_0/out"]}}],"op_type_name":"summary_write_image"}},"inbound_nodes":["Input_187_0","Input_186_0","Input_185_0"],"name":"WriteImage_188_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["10"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_187_0","trainable":false},"inbound_nodes":[],"name":"Input_187_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt64","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_186_0","trainable":false},"inbound_nodes":[],"name":"Input_186_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kUInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["100","2000","2000","4"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_185_0","trainable":false},"inbound_nodes":[],"name":"Input_185_0"}],"name":"ImageJob","output_layers":[]}},{"backend":"tsvis","class_name":"Model","config":{"input_layers":["Input_178_0","Input_179_0","Input_180_0"],"layers":[{"class_name":"summary_write_histogram","config":{"device_type":"kCPU","enable_cudnn":true,"name":"WriteHistogram_181_0","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Input_178_0/out"]}},{"key":"step","value":{"s":["Input_179_0/out"]}},{"key":"tag","value":{"s":["Input_180_0/out"]}}],"op_type_name":"summary_write_histogram"}},"inbound_nodes":["Input_180_0","Input_179_0","Input_178_0"],"name":"WriteHistogram_181_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1000"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_180_0","trainable":false},"inbound_nodes":[],"name":"Input_180_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt64","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_179_0","trainable":false},"inbound_nodes":[],"name":"Input_179_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kFloat","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["130","2048","10","10"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_178_0","trainable":false},"inbound_nodes":[],"name":"Input_178_0"}],"name":"HistogramJob2","output_layers":[]}},{"backend":"tsvis","class_name":"Model","config":{"input_layers":["Input_174_0","Input_175_0","Input_176_0"],"layers":[{"class_name":"summary_write_histogram","config":{"device_type":"kCPU","enable_cudnn":true,"name":"WriteHistogram_177_0","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Input_174_0/out"]}},{"key":"step","value":{"s":["Input_175_0/out"]}},{"key":"tag","value":{"s":["Input_176_0/out"]}}],"op_type_name":"summary_write_histogram"}},"inbound_nodes":["Input_176_0","Input_175_0","Input_174_0"],"name":"WriteHistogram_177_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1000"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_176_0","trainable":false},"inbound_nodes":[],"name":"Input_176_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt64","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_175_0","trainable":false},"inbound_nodes":[],"name":"Input_175_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kFloat","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["150","80","120","120"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_174_0","trainable":false},"inbound_nodes":[],"name":"Input_174_0"}],"name":"HistogramJob","output_layers":[]}},{"backend":"tsvis","class_name":"Model","config":{"input_layers":["Input_170_0","Input_171_0","Input_172_0"],"layers":[{"class_name":"summary_write_scalar","config":{"device_type":"kCPU","enable_cudnn":true,"name":"WriteScalar_173_0","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Input_170_0/out"]}},{"key":"step","value":{"s":["Input_171_0/out"]}},{"key":"tag","value":{"s":["Input_172_0/out"]}}],"op_type_name":"summary_write_scalar"}},"inbound_nodes":["Input_172_0","Input_171_0","Input_170_0"],"name":"WriteScalar_173_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1000"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_172_0","trainable":false},"inbound_nodes":[],"name":"Input_172_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt64","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_171_0","trainable":false},"inbound_nodes":[],"name":"Input_171_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kFloat","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]},"split_axis":{"value":"0"}},"out":"out"},"name":"Input_170_0","trainable":false},"inbound_nodes":[],"name":"Input_170_0"}],"name":"ScalarJob","output_layers":[]}},{"backend":"tsvis","class_name":"Model","config":{"input_layers":[],"layers":[{"class_name":"create_summary_writer","config":{"device_type":"kCPU","enable_cudnn":true,"name":"CreateWriter_169_0","trainable":false,"user_conf":{"attr":[{"key":"logdir","value":{"at_string":"/home/zjhushengjian/tsvis"}}],"op_type_name":"create_summary_writer"}},"inbound_nodes":[],"name":"CreateWriter_169_0"}],"name":"CreateWriter","output_layers":[]}},{"backend":"tsvis","class_name":"Model","config":{"input_layers":[],"layers":[{"class_name":"system_op","config":{"device_type":"kCPU","enable_cudnn":true,"name":"Return_168","return_conf":{"in":"OFRecordRawDecoder_97/out_0","out":"out"},"trainable":false},"inbound_nodes":["OFRecordRawDecoder_97"],"name":"Return_168"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-fc1001-bias","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"model_name":"bias","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["1000"]}}},"inbound_nodes":[],"name":"Resnet-fc1001-bias"},{"class_name":"matmul","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-fc1001_matmul","trainable":false,"user_conf":{"attr":[{"key":"transpose_a","value":{"at_bool":false}},{"key":"transpose_b","value":{"at_bool":true}}],"input":[{"key":"a","value":{"s":["Resnet-Reshape_165/out_0"]}},{"key":"b","value":{"s":["Resnet-fc1001-weight/out:B"]}}],"op_type_name":"matmul","output":[{"key":"out","value":{"s":["Resnet-fc1001_matmul/out_0"]}}]}},"inbound_nodes":["Resnet-fc1001-weight","Resnet-Reshape_165"],"name":"Resnet-fc1001_matmul"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-fc1001-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["1000","2048"]}}},"inbound_nodes":[],"name":"Resnet-fc1001-weight"},{"class_name":"reshape","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Reshape_165","trainable":false,"user_conf":{"attr":[{"key":"shape","value":{"at_shape":{"dim":["125","2048"]}}}],"input":[{"key":"in","value":{"s":["Resnet-pool5/y_0"]}}],"op_type_name":"reshape","output":[{"key":"out","value":{"s":["Resnet-Reshape_165/out_0"]}}]}},"inbound_nodes":["Resnet-pool5"],"name":"Resnet-Reshape_165"},{"class_name":"add_n","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-AddN_163","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Resnet-res5_2_branch2c_bn/y_0","Resnet-Relu_160/out_0"]}}],"op_type_name":"add_n","output":[{"key":"out","value":{"s":["Resnet-AddN_163/out_0"]}}]}},"inbound_nodes":["Resnet-Relu_160","Resnet-res5_2_branch2c_bn"],"name":"Resnet-AddN_163"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2c_bn-gamma","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["2048"]}}},"inbound_nodes":[],"name":"Resnet-res5_2_branch2c_bn-gamma"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2c_bn-beta","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["2048"]}}},"inbound_nodes":[],"name":"Resnet-res5_2_branch2c_bn-beta"},{"class_name":"conv2d","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2c","trainable":false,"user_conf":{"attr":[{"key":"groups","value":{"at_int32":1}},{"key":"filters","value":{"at_int32":2048}},{"key":"padding","value":{"at_string":"valid"}},{"key":"strides","value":{"at_list_int32":{"val":[1,1]}}},{"key":"dilation_rate","value":{"at_list_int32":{"val":[1,1]}}},{"key":"data_format","value":{"at_string":"channels_first"}},{"key":"kernel_size","value":{"at_list_int32":{"val":[1,1]}}}],"input":[{"key":"in","value":{"s":["Resnet-Relu_162/out_0"]}},{"key":"weight","value":{"s":["Resnet-res5_2_branch2c-weight/out"]}}],"op_type_name":"conv2d","output":[{"key":"out","value":{"s":["Resnet-res5_2_branch2c/out_0"]}}]}},"inbound_nodes":["Resnet-res5_2_branch2c-weight","Resnet-Relu_162"],"name":"Resnet-res5_2_branch2c"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_162","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Resnet-res5_2_branch2b_bn/y_0"]}}],"op_type_name":"relu","output":[{"key":"out","value":{"s":["Resnet-Relu_162/out_0"]}}]}},"inbound_nodes":["Resnet-res5_2_branch2b_bn"],"name":"Resnet-Relu_162"},{"class_name":"normalization","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2b_bn","trainable":false,"user_conf":{"attr":[{"key":"epsilon","value":{"at_float":9.999999747378752e-06}},{"key":"axis","value":{"at_int32":1}},{"key":"training","value":{"at_bool":false}},{"key":"momentum","value":{"at_float":0.8999999761581421}}],"input":[{"key":"gamma","value":{"s":["Resnet-res5_2_branch2b_bn-gamma/out"]}},{"key":"beta","value":{"s":["Resnet-res5_2_branch2b_bn-beta/out"]}},{"key":"moving_variance","value":{"s":["Resnet-res5_2_branch2b_bn-moving_variance/out"]}},{"key":"moving_mean","value":{"s":["Resnet-res5_2_branch2b_bn-moving_mean/out"]}},{"key":"x","value":{"s":["Resnet-res5_2_branch2b/out_0"]}}],"op_type_name":"normalization","output":[{"key":"y","value":{"s":["Resnet-res5_2_branch2b_bn/y_0"]}}]}},"inbound_nodes":["Resnet-res5_2_branch2b","Resnet-res5_2_branch2b_bn-moving_mean","Resnet-res5_2_branch2b_bn-moving_variance","Resnet-res5_2_branch2b_bn-beta","Resnet-res5_2_branch2b_bn-gamma"],"name":"Resnet-res5_2_branch2b_bn"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2b_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res5_2_branch2b_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2b_bn-moving_mean","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res5_2_branch2b_bn-moving_mean"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2b_bn-beta","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res5_2_branch2b_bn-beta"},{"class_name":"conv2d","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2b","trainable":false,"user_conf":{"attr":[{"key":"groups","value":{"at_int32":1}},{"key":"filters","value":{"at_int32":512}},{"key":"padding","value":{"at_string":"same"}},{"key":"strides","value":{"at_list_int32":{"val":[1,1]}}},{"key":"dilation_rate","value":{"at_list_int32":{"val":[1,1]}}},{"key":"data_format","value":{"at_string":"channels_first"}},{"key":"kernel_size","value":{"at_list_int32":{"val":[3,3]}}}],"input":[{"key":"in","value":{"s":["Resnet-Relu_161/out_0"]}},{"key":"weight","value":{"s":["Resnet-res5_2_branch2b-weight/out"]}}],"op_type_name":"conv2d","output":[{"key":"out","value":{"s":["Resnet-res5_2_branch2b/out_0"]}}]}},"inbound_nodes":["Resnet-res5_2_branch2b-weight","Resnet-Relu_161"],"name":"Resnet-res5_2_branch2b"},{"class_name":"normalization","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2a_bn","trainable":false,"user_conf":{"attr":[{"key":"epsilon","value":{"at_float":9.999999747378752e-06}},{"key":"axis","value":{"at_int32":1}},{"key":"training","value":{"at_bool":false}},{"key":"momentum","value":{"at_float":0.8999999761581421}}],"input":[{"key":"gamma","value":{"s":["Resnet-res5_2_branch2a_bn-gamma/out"]}},{"key":"beta","value":{"s":["Resnet-res5_2_branch2a_bn-beta/out"]}},{"key":"moving_variance","value":{"s":["Resnet-res5_2_branch2a_bn-moving_variance/out"]}},{"key":"moving_mean","value":{"s":["Resnet-res5_2_branch2a_bn-moving_mean/out"]}},{"key":"x","value":{"s":["Resnet-res5_2_branch2a/out_0"]}}],"op_type_name":"normalization","output":[{"key":"y","value":{"s":["Resnet-res5_2_branch2a_bn/y_0"]}}]}},"inbound_nodes":["Resnet-res5_2_branch2a","Resnet-res5_2_branch2a_bn-moving_mean","Resnet-res5_2_branch2a_bn-moving_variance","Resnet-res5_2_branch2a_bn-beta","Resnet-res5_2_branch2a_bn-gamma"],"name":"Resnet-res5_2_branch2a_bn"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2a_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res5_2_branch2a_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2a_bn-moving_mean","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res5_2_branch2a_bn-moving_mean"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2a_bn-gamma","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res5_2_branch2a_bn-gamma"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2a_bn-beta","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res5_2_branch2a_bn-beta"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_2_branch2a-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["512","2048","1","1"]}}},"inbound_nodes":[],"name":"Resnet-res5_2_branch2a-weight"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_160","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Resnet-AddN_159/out_0"]}}],"op_type_name":"relu","output":[{"key":"out","value":{"s":["Resnet-Relu_160/out_0"]}}]}},"inbound_nodes":["Resnet-AddN_159"],"name":"Resnet-Relu_160"},{"class_name":"add_n","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-AddN_159","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Resnet-res5_1_branch2c_bn/y_0","Resnet-Relu_156/out_0"]}}],"op_type_name":"add_n","output":[{"key":"out","value":{"s":["Resnet-AddN_159/out_0"]}}]}},"inbound_nodes":["Resnet-Relu_156","Resnet-res5_1_branch2c_bn"],"name":"Resnet-AddN_159"},{"class_name":"normalization","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_1_branch2c_bn","trainable":false,"user_conf":{"attr":[{"key":"epsilon","value":{"at_float":9.999999747378752e-06}},{"key":"axis","value":{"at_int32":1}},{"key":"training","value":{"at_bool":false}},{"key":"momentum","value":{"at_float":0.8999999761581421}}],"input":[{"key":"gamma","value":{"s":["Resnet-res5_1_branch2c_bn-gamma/out"]}},{"key":"beta","value":{"s":["Resnet-res5_1_branch2c_bn-beta/out"]}},{"key":"moving_variance","value":{"s":["Resnet-res5_1_branch2c_bn-moving_variance/out"]}},{"key":"moving_mean","value":{"s":["Resnet-res5_1_branch2c_bn-moving_mean/out"]}},{"key":"x","value":{"s":["Resnet-res5_1_branch2c/out_0"]}}],"op_type_name":"normalization","output":[{"key":"y","value":{"s":["Resnet-res5_1_branch2c_bn/y_0"]}}]}},"inbound_nodes":["Resnet-res5_1_branch2c","Resnet-res5_1_branch2c_bn-moving_mean","Resnet-res5_1_branch2c_bn-moving_variance","Resnet-res5_1_branch2c_bn-beta","Resnet-res5_1_branch2c_bn-gamma"],"name":"Resnet-res5_1_branch2c_bn"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_1_branch2c_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["2048"]}}},"inbound_nodes":[],"name":"Resnet-res5_1_branch2c_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_1_branch2c_bn-moving_mean","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["2048"]}}},"inbound_nodes":[],"name":"Resnet-res5_1_branch2c_bn-moving_mean"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_1_branch2c_bn-gamma","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["2048"]}}},"inbound_nodes":[],"name":"Resnet-res5_1_branch2c_bn-gamma"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_1_branch2c_bn-beta","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["2048"]}}},"inbound_nodes":[],"name":"Resnet-res5_1_branch2c_bn-beta"},{"class_name":"conv2d","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_1_branch2c","trainable":false,"user_conf":{"attr":[{"key":"groups","value":{"at_int32":1}},{"key":"filters","value":{"at_int32":2048}},{"key":"padding","value":{"at_string":"valid"}},{"key":"strides","value":{"at_list_int32":{"val":[1,1]}}},{"key":"dilation_rate","value":{"at_list_int32":{"val":[1,1]}}},{"key":"data_format","value":{"at_string":"channels_first"}},{"key":"kernel_size","value":{"at_list_int32":{"val":[1,1]}}}],"input":[{"key":"in","value":{"s":["Resnet-Relu_158/out_0"]}},{"key":"weight","value":{"s":["Resnet-res5_1_branch2c-weight/out"]}}],"op_type_name":"conv2d","output":[{"key":"out","value":{"s":["Resnet-res5_1_branch2c/out_0"]}}]}},"inbound_nodes":["Resnet-res5_1_branch2c-weight","Resnet-Relu_158"],"name":"Resnet-res5_1_branch2c"},{"class_name":"conv2d","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2c","trainable":false,"user_conf":{"attr":[{"key":"groups","value":{"at_int32":1}},{"key":"filters","value":{"at_int32":512}},{"key":"padding","value":{"at_string":"valid"}},{"key":"strides","value":{"at_list_int32":{"val":[1,1]}}},{"key":"dilation_rate","value":{"at_list_int32":{"val":[1,1]}}},{"key":"data_format","value":{"at_string":"channels_first"}},{"key":"kernel_size","value":{"at_list_int32":{"val":[1,1]}}}],"input":[{"key":"in","value":{"s":["Resnet-Relu_118/out_0"]}},{"key":"weight","value":{"s":["Resnet-res3_1_branch2c-weight/out"]}}],"op_type_name":"conv2d","output":[{"key":"out","value":{"s":["Resnet-res3_1_branch2c/out_0"]}}]}},"inbound_nodes":["Resnet-res3_1_branch2c-weight","Resnet-Relu_118"],"name":"Resnet-res3_1_branch2c"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res2_0_branch2a_bn-gamma","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["64"]}}},"inbound_nodes":[],"name":"Resnet-res2_0_branch2a_bn-gamma"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_3_branch2b_bn-beta","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_3_branch2b_bn-beta"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_2_branch2b_bn-gamma","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_2_branch2b_bn-gamma"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res4_2_branch2c_bn-moving_mean","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["1024"]}}},"inbound_nodes":[],"name":"Resnet-res4_2_branch2c_bn-moving_mean"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_1_branch2c-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["2048","512","1","1"]}}},"inbound_nodes":[],"name":"Resnet-res5_1_branch2c-weight"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_3_branch2b-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128","128","3","3"]}}},"inbound_nodes":[],"name":"Resnet-res3_3_branch2b-weight"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res2_0_branch2c-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["256","64","1","1"]}}},"inbound_nodes":[],"name":"Resnet-res2_0_branch2c-weight"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_3_branch2b_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_3_branch2b_bn-moving_variance"},{"class_name":"normalization","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_3_branch2a_bn","trainable":false,"user_conf":{"attr":[{"key":"epsilon","value":{"at_float":9.999999747378752e-06}},{"key":"axis","value":{"at_int32":1}},{"key":"training","value":{"at_bool":false}},{"key":"momentum","value":{"at_float":0.8999999761581421}}],"input":[{"key":"gamma","value":{"s":["Resnet-res3_3_branch2a_bn-gamma/out"]}},{"key":"beta","value":{"s":["Resnet-res3_3_branch2a_bn-beta/out"]}},{"key":"moving_variance","value":{"s":["Resnet-res3_3_branch2a_bn-moving_variance/out"]}},{"key":"moving_mean","value":{"s":["Resnet-res3_3_branch2a_bn-moving_mean/out"]}},{"key":"x","value":{"s":["Resnet-res3_3_branch2a/out_0"]}}],"op_type_name":"normalization","output":[{"key":"y","value":{"s":["Resnet-res3_3_branch2a_bn/y_0"]}}]}},"inbound_nodes":["Resnet-res3_3_branch2a","Resnet-res3_3_branch2a_bn-moving_mean","Resnet-res3_3_branch2a_bn-moving_variance","Resnet-res3_3_branch2a_bn-beta","Resnet-res3_3_branch2a_bn-gamma"],"name":"Resnet-res3_3_branch2a_bn"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_0_branch2a_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res5_0_branch2a_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_3_branch2a_bn-moving_mean","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_3_branch2a_bn-moving_mean"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_0_branch2b-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128","128","3","3"]}}},"inbound_nodes":[],"name":"Resnet-res3_0_branch2b-weight"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_1_branch2a_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res5_1_branch2a_bn-moving_variance"},{"class_name":"conv2d","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_3_branch2a","trainable":false,"user_conf":{"attr":[{"key":"groups","value":{"at_int32":1}},{"key":"filters","value":{"at_int32":128}},{"key":"padding","value":{"at_string":"valid"}},{"key":"strides","value":{"at_list_int32":{"val":[1,1]}}},{"key":"dilation_rate","value":{"at_list_int32":{"val":[1,1]}}},{"key":"data_format","value":{"at_string":"channels_first"}},{"key":"kernel_size","value":{"at_list_int32":{"val":[1,1]}}}],"input":[{"key":"in","value":{"s":["Resnet-Relu_124/out_0"]}},{"key":"weight","value":{"s":["Resnet-res3_3_branch2a-weight/out"]}}],"op_type_name":"conv2d","output":[{"key":"out","value":{"s":["Resnet-res3_3_branch2a/out_0"]}}]}},"inbound_nodes":["Resnet-res3_3_branch2a-weight","Resnet-Relu_124"],"name":"Resnet-res3_3_branch2a"},{"class_name":"conv2d","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res2_0_branch1","trainable":false,"user_conf":{"attr":[{"key":"groups","value":{"at_int32":1}},{"key":"filters","value":{"at_int32":256}},{"key":"padding","value":{"at_string":"valid"}},{"key":"strides","value":{"at_list_int32":{"val":[1,1]}}},{"key":"dilation_rate","value":{"at_list_int32":{"val":[1,1]}}},{"key":"data_format","value":{"at_string":"channels_first"}},{"key":"kernel_size","value":{"at_list_int32":{"val":[1,1]}}}],"input":[{"key":"in","value":{"s":["Resnet-pool1/y_0"]}},{"key":"weight","value":{"s":["Resnet-res2_0_branch1-weight/out"]}}],"op_type_name":"conv2d","output":[{"key":"out","value":{"s":["Resnet-res2_0_branch1/out_0"]}}]}},"inbound_nodes":["Resnet-res2_0_branch1-weight","Resnet-pool1"],"name":"Resnet-res2_0_branch1"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_124","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Resnet-AddN_123/out_0"]}}],"op_type_name":"relu","output":[{"key":"out","value":{"s":["Resnet-Relu_124/out_0"]}}]}},"inbound_nodes":["Resnet-AddN_123"],"name":"Resnet-Relu_124"},{"class_name":"normalization","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_2_branch2c_bn","trainable":false,"user_conf":{"attr":[{"key":"epsilon","value":{"at_float":9.999999747378752e-06}},{"key":"axis","value":{"at_int32":1}},{"key":"training","value":{"at_bool":false}},{"key":"momentum","value":{"at_float":0.8999999761581421}}],"input":[{"key":"gamma","value":{"s":["Resnet-res3_2_branch2c_bn-gamma/out"]}},{"key":"beta","value":{"s":["Resnet-res3_2_branch2c_bn-beta/out"]}},{"key":"moving_variance","value":{"s":["Resnet-res3_2_branch2c_bn-moving_variance/out"]}},{"key":"moving_mean","value":{"s":["Resnet-res3_2_branch2c_bn-moving_mean/out"]}},{"key":"x","value":{"s":["Resnet-res3_2_branch2c/out_0"]}}],"op_type_name":"normalization","output":[{"key":"y","value":{"s":["Resnet-res3_2_branch2c_bn/y_0"]}}]}},"inbound_nodes":["Resnet-res3_2_branch2c","Resnet-res3_2_branch2c_bn-moving_mean","Resnet-res3_2_branch2c_bn-moving_variance","Resnet-res3_2_branch2c_bn-beta","Resnet-res3_2_branch2c_bn-gamma"],"name":"Resnet-res3_2_branch2c_bn"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_2_branch2c_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res3_2_branch2c_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_0_branch2b_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_0_branch2b_bn-moving_variance"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_144","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Resnet-AddN_143/out_0"]}}],"op_type_name":"relu","output":[{"key":"out","value":{"s":["Resnet-Relu_144/out_0"]}}]}},"inbound_nodes":["Resnet-AddN_143"],"name":"Resnet-Relu_144"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res5_0_branch1-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["2048","1024","1","1"]}}},"inbound_nodes":[],"name":"Resnet-res5_0_branch1-weight"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_2_branch2c_bn-gamma","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res3_2_branch2c_bn-gamma"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_2_branch2b_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_2_branch2b_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_2_branch2b_bn-beta","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_2_branch2b_bn-beta"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_2_branch2a_bn-moving_mean","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_2_branch2a_bn-moving_mean"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2b_bn-beta","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_1_branch2b_bn-beta"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res4_4_branch2a_bn-moving_mean","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["256"]}}},"inbound_nodes":[],"name":"Resnet-res4_4_branch2a_bn-moving_mean"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_2_branch2a_bn-gamma","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_2_branch2a_bn-gamma"},{"class_name":"normalization","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_3_branch2b_bn","trainable":false,"user_conf":{"attr":[{"key":"epsilon","value":{"at_float":9.999999747378752e-06}},{"key":"axis","value":{"at_int32":1}},{"key":"training","value":{"at_bool":false}},{"key":"momentum","value":{"at_float":0.8999999761581421}}],"input":[{"key":"gamma","value":{"s":["Resnet-res3_3_branch2b_bn-gamma/out"]}},{"key":"beta","value":{"s":["Resnet-res3_3_branch2b_bn-beta/out"]}},{"key":"moving_variance","value":{"s":["Resnet-res3_3_branch2b_bn-moving_variance/out"]}},{"key":"moving_mean","value":{"s":["Resnet-res3_3_branch2b_bn-moving_mean/out"]}},{"key":"x","value":{"s":["Resnet-res3_3_branch2b/out_0"]}}],"op_type_name":"normalization","output":[{"key":"y","value":{"s":["Resnet-res3_3_branch2b_bn/y_0"]}}]}},"inbound_nodes":["Resnet-res3_3_branch2b","Resnet-res3_3_branch2b_bn-moving_mean","Resnet-res3_3_branch2b_bn-beta","Resnet-res3_3_branch2b_bn-moving_variance","Resnet-res3_3_branch2b_bn-gamma"],"name":"Resnet-res3_3_branch2b_bn"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_3_branch2a-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128","512","1","1"]}}},"inbound_nodes":[],"name":"Resnet-res3_3_branch2a-weight"},{"class_name":"conv2d","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_2_branch2a","trainable":false,"user_conf":{"attr":[{"key":"groups","value":{"at_int32":1}},{"key":"filters","value":{"at_int32":128}},{"key":"padding","value":{"at_string":"valid"}},{"key":"strides","value":{"at_list_int32":{"val":[1,1]}}},{"key":"dilation_rate","value":{"at_list_int32":{"val":[1,1]}}},{"key":"data_format","value":{"at_string":"channels_first"}},{"key":"kernel_size","value":{"at_list_int32":{"val":[1,1]}}}],"input":[{"key":"in","value":{"s":["Resnet-Relu_120/out_0"]}},{"key":"weight","value":{"s":["Resnet-res3_2_branch2a-weight/out"]}}],"op_type_name":"conv2d","output":[{"key":"out","value":{"s":["Resnet-res3_2_branch2a/out_0"]}}]}},"inbound_nodes":["Resnet-res3_2_branch2a-weight","Resnet-Relu_120"],"name":"Resnet-res3_2_branch2a"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res4_5_branch2a_bn-beta","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["256"]}}},"inbound_nodes":[],"name":"Resnet-res4_5_branch2a_bn-beta"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_120","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Resnet-AddN_119/out_0"]}}],"op_type_name":"relu","output":[{"key":"out","value":{"s":["Resnet-Relu_120/out_0"]}}]}},"inbound_nodes":["Resnet-AddN_119"],"name":"Resnet-Relu_120"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res4_1_branch2c_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["1024"]}}},"inbound_nodes":[],"name":"Resnet-res4_1_branch2c_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2c_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res3_1_branch2c_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_3_branch2c-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["512","128","1","1"]}}},"inbound_nodes":[],"name":"Resnet-res3_3_branch2c-weight"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2c_bn-gamma","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res3_1_branch2c_bn-gamma"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res4_1_branch2b_bn-beta","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["256"]}}},"inbound_nodes":[],"name":"Resnet-res4_1_branch2b_bn-beta"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res4_5_branch2a-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["256","1024","1","1"]}}},"inbound_nodes":[],"name":"Resnet-res4_5_branch2a-weight"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res2_0_branch2a_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["64"]}}},"inbound_nodes":[],"name":"Resnet-res2_0_branch2a_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res2_0_branch1_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["256"]}}},"inbound_nodes":[],"name":"Resnet-res2_0_branch1_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2c-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["512","128","1","1"]}}},"inbound_nodes":[],"name":"Resnet-res3_1_branch2c-weight"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2b_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_1_branch2b_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2b-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128","128","3","3"]}}},"inbound_nodes":[],"name":"Resnet-res3_1_branch2b-weight"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2a_bn-gamma","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_1_branch2a_bn-gamma"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2a_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":1.0}},"out":"out","shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_1_branch2a_bn-moving_variance"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2a-weight","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"shape":{"dim":["128","512","1","1"]}}},"inbound_nodes":[],"name":"Resnet-res3_1_branch2a-weight"},{"class_name":"normalization","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res2_1_branch2a_bn","trainable":false,"user_conf":{"attr":[{"key":"epsilon","value":{"at_float":9.999999747378752e-06}},{"key":"axis","value":{"at_int32":1}},{"key":"training","value":{"at_bool":false}},{"key":"momentum","value":{"at_float":0.8999999761581421}}],"input":[{"key":"gamma","value":{"s":["Resnet-res2_1_branch2a_bn-gamma/out"]}},{"key":"beta","value":{"s":["Resnet-res2_1_branch2a_bn-beta/out"]}},{"key":"moving_variance","value":{"s":["Resnet-res2_1_branch2a_bn-moving_variance/out"]}},{"key":"moving_mean","value":{"s":["Resnet-res2_1_branch2a_bn-moving_mean/out"]}},{"key":"x","value":{"s":["Resnet-res2_1_branch2a/out_0"]}}],"op_type_name":"normalization","output":[{"key":"y","value":{"s":["Resnet-res2_1_branch2a_bn/y_0"]}}]}},"inbound_nodes":["Resnet-res2_1_branch2a_bn-moving_mean","Resnet-res2_1_branch2a_bn-moving_variance","Resnet-res2_1_branch2a","Resnet-res2_1_branch2a_bn-beta","Resnet-res2_1_branch2a_bn-gamma"],"name":"Resnet-res2_1_branch2a_bn"},{"class_name":"add_n","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-AddN_115","trainable":false,"user_conf":{"input":[{"key":"in","value":{"s":["Resnet-res3_0_branch2c_bn/y_0","Resnet-res3_0_branch1_bn/y_0"]}}],"op_type_name":"add_n","output":[{"key":"out","value":{"s":["Resnet-AddN_115/out_0"]}}]}},"inbound_nodes":["Resnet-res3_0_branch1_bn","Resnet-res3_0_branch2c_bn"],"name":"Resnet-AddN_115"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_1_branch2b_bn-moving_mean","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["128"]}}},"inbound_nodes":[],"name":"Resnet-res3_1_branch2b_bn-moving_mean"},{"class_name":"normalization","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_0_branch2c_bn","trainable":false,"user_conf":{"attr":[{"key":"epsilon","value":{"at_float":9.999999747378752e-06}},{"key":"axis","value":{"at_int32":1}},{"key":"training","value":{"at_bool":false}},{"key":"momentum","value":{"at_float":0.8999999761581421}}],"input":[{"key":"gamma","value":{"s":["Resnet-res3_0_branch2c_bn-gamma/out"]}},{"key":"beta","value":{"s":["Resnet-res3_0_branch2c_bn-beta/out"]}},{"key":"moving_variance","value":{"s":["Resnet-res3_0_branch2c_bn-moving_variance/out"]}},{"key":"moving_mean","value":{"s":["Resnet-res3_0_branch2c_bn-moving_mean/out"]}},{"key":"x","value":{"s":["Resnet-res3_0_branch2c/out_0"]}}],"op_type_name":"normalization","output":[{"key":"y","value":{"s":["Resnet-res3_0_branch2c_bn/y_0"]}}]}},"inbound_nodes":["Resnet-res3_0_branch2c","Resnet-res3_0_branch2c_bn-moving_mean","Resnet-res3_0_branch2c_bn-moving_variance","Resnet-res3_0_branch2c_bn-beta","Resnet-res3_0_branch2c_bn-gamma"],"name":"Resnet-res3_0_branch2c_bn"},{"class_name":"normalization","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_2_branch2a_bn","trainable":false,"user_conf":{"attr":[{"key":"epsilon","value":{"at_float":9.999999747378752e-06}},{"key":"axis","value":{"at_int32":1}},{"key":"training","value":{"at_bool":false}},{"key":"momentum","value":{"at_float":0.8999999761581421}}],"input":[{"key":"gamma","value":{"s":["Resnet-res3_2_branch2a_bn-gamma/out"]}},{"key":"beta","value":{"s":["Resnet-res3_2_branch2a_bn-beta/out"]}},{"key":"moving_variance","value":{"s":["Resnet-res3_2_branch2a_bn-moving_variance/out"]}},{"key":"moving_mean","value":{"s":["Resnet-res3_2_branch2a_bn-moving_mean/out"]}},{"key":"x","value":{"s":["Resnet-res3_2_branch2a/out_0"]}}],"op_type_name":"normalization","output":[{"key":"y","value":{"s":["Resnet-res3_2_branch2a_bn/y_0"]}}]}},"inbound_nodes":["Resnet-res3_2_branch2a_bn-moving_variance","Resnet-res3_2_branch2a_bn-moving_mean","Resnet-res3_2_branch2a_bn-beta","Resnet-res3_2_branch2a","Resnet-res3_2_branch2a_bn-gamma"],"name":"Resnet-res3_2_branch2a_bn"},{"class_name":"variable","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res3_0_branch2c_bn-moving_variance","trainable":false,"variable_conf":{"data_type":"kFloat","initializer":{"constant_conf":{"value":0.0}},"out":"out","shape":{"dim":["512"]}}},"inbound_nodes":[],"name":"Resnet-res3_0_branch2c_bn-moving_variance"},{"class_name":"normalization","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-res2_1_branch2c_bn","trainable":false,"user_conf":{"attr":[{"key":"epsilon","value":{"at_float":9.999999747378752e-06}},{"key":"axis","value":{"at_int32":1}},{"key":"training","value":{"at_bool":false}},