[{"backend":"oneflow","class_name":"Model","config":{"input_layers":["Input_108_0","Input_109_0"],"layers":[{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt64","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]}},"out":"out"},"name":"Input_109_0","scope_symbol_id":"4611686018427482110","trainable":false},"inbound_nodes":[],"name":"Input_109_0"},{"class_name":"summary_write_pb","config":{"device_type":"kCPU","enable_cudnn":true,"name":"WritePb_110_0","scope_symbol_id":"4611686018427482110","trainable":false},"inbound_nodes":["Input_109_0","Input_108_0"],"name":"WritePb_110_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1000"]}},"out":"out"},"name":"Input_108_0","scope_symbol_id":"4611686018427482110","trainable":false},"inbound_nodes":[],"name":"Input_108_0"}],"name":"PbJob","output_layers":[]}},{"backend":"oneflow","class_name":"Model","config":{"input_layers":["Input_111_0","Input_113_0","Input_112_0"],"layers":[{"class_name":"summary_write_image","config":{"device_type":"kCPU","enable_cudnn":true,"name":"WriteImage_114_0","scope_symbol_id":"4611686018427490302","trainable":false},"inbound_nodes":["Input_112_0","Input_113_0","Input_111_0"],"name":"WriteImage_114_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt64","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]}},"out":"out"},"name":"Input_112_0","scope_symbol_id":"4611686018427490302","trainable":false},"inbound_nodes":[],"name":"Input_112_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["100"]}},"out":"out"},"name":"Input_113_0","scope_symbol_id":"4611686018427490302","trainable":false},"inbound_nodes":[],"name":"Input_113_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kUInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["100","2000","2000","4"]}},"out":"out"},"name":"Input_111_0","scope_symbol_id":"4611686018427490302","trainable":false},"inbound_nodes":[],"name":"Input_111_0"}],"name":"ImageJob","output_layers":[]}},{"backend":"oneflow","class_name":"Model","config":{"input_layers":["Input_104_0","Input_105_0","Input_106_0"],"layers":[{"class_name":"summary_write_histogram","config":{"device_type":"kCPU","enable_cudnn":true,"name":"WriteHistogram_107_0","scope_symbol_id":"4611686018427473918","trainable":false},"inbound_nodes":["Input_106_0","Input_105_0","Input_104_0"],"name":"WriteHistogram_107_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1000"]}},"out":"out"},"name":"Input_106_0","scope_symbol_id":"4611686018427473918","trainable":false},"inbound_nodes":[],"name":"Input_106_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt64","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]}},"out":"out"},"name":"Input_105_0","scope_symbol_id":"4611686018427473918","trainable":false},"inbound_nodes":[],"name":"Input_105_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kFloat","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["130","2048","10","10"]}},"out":"out"},"name":"Input_104_0","scope_symbol_id":"4611686018427473918","trainable":false},"inbound_nodes":[],"name":"Input_104_0"}],"name":"HistogramJob2","output_layers":[]}},{"backend":"oneflow","class_name":"Model","config":{"input_layers":["Input_100_0","Input_101_0","Input_102_0"],"layers":[{"class_name":"summary_write_histogram","config":{"device_type":"kCPU","enable_cudnn":true,"name":"WriteHistogram_103_0","scope_symbol_id":"4611686018427465726","trainable":false},"inbound_nodes":["Input_102_0","Input_101_0","Input_100_0"],"name":"WriteHistogram_103_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1000"]}},"out":"out"},"name":"Input_102_0","scope_symbol_id":"4611686018427465726","trainable":false},"inbound_nodes":[],"name":"Input_102_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt64","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]}},"out":"out"},"name":"Input_101_0","scope_symbol_id":"4611686018427465726","trainable":false},"inbound_nodes":[],"name":"Input_101_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kFloat","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["150","80","120","120"]}},"out":"out"},"name":"Input_100_0","scope_symbol_id":"4611686018427465726","trainable":false},"inbound_nodes":[],"name":"Input_100_0"}],"name":"HistogramJob","output_layers":[]}},{"backend":"oneflow","class_name":"Model","config":{"input_layers":["Input_96_0","Input_97_0","Input_98_0"],"layers":[{"class_name":"summary_write_scalar","config":{"device_type":"kCPU","enable_cudnn":true,"name":"WriteScalar_99_0","scope_symbol_id":"4611686018427457534","trainable":false},"inbound_nodes":["Input_98_0","Input_97_0","Input_96_0"],"name":"WriteScalar_99_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt8","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1000"]}},"out":"out"},"name":"Input_98_0","scope_symbol_id":"4611686018427457534","trainable":false},"inbound_nodes":[],"name":"Input_98_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kInt64","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]}},"out":"out"},"name":"Input_97_0","scope_symbol_id":"4611686018427457534","trainable":false},"inbound_nodes":[],"name":"Input_97_0"},{"class_name":"input","config":{"device_type":"kGPU","enable_cudnn":true,"input_conf":{"blob_conf":{"batch_axis":{"value":"0"},"data_type":"kFloat","is_dynamic":true,"is_tensor_list":false,"shape":{"dim":["1"]}},"out":"out"},"name":"Input_96_0","scope_symbol_id":"4611686018427457534","trainable":false},"inbound_nodes":[],"name":"Input_96_0"}],"name":"ScalarJob","output_layers":[]}},{"backend":"oneflow","class_name":"Model","config":{"input_layers":[],"layers":[{"class_name":"create_summary_writer","config":{"device_type":"kCPU","enable_cudnn":true,"logdir":"/workspace/visualizedlog","name":"CreateWriter_95_0","scope_symbol_id":"4611686018427449342","trainable":false},"inbound_nodes":[],"name":"CreateWriter_95_0"}],"name":"CreateWriter","output_layers":[]}},{"backend":"oneflow","class_name":"Model","config":{"input_layers":[],"layers":[{"class_name":"system_op","config":{"device_type":"kCPU","enable_cudnn":true,"name":"Return_94","return_conf":{"in":"Resnet-pool5/y_0","out":"out"},"scope_symbol_id":"4611686018427441150"},"inbound_nodes":["Resnet-pool5"],"name":"Return_94"},{"class_name":"system_op","config":{"device_type":"kCPU","enable_cudnn":true,"name":"Return_93","return_conf":{"in":"Resnet-conv1/out_0","out":"out"},"scope_symbol_id":"4611686018427437054"},"inbound_nodes":["Resnet-conv1"],"name":"Return_93"},{"class_name":"system_op","config":{"device_type":"kCPU","enable_cudnn":true,"name":"Return_92","return_conf":{"in":"transpose/output_0","out":"out"},"scope_symbol_id":"4611686018427432958"},"inbound_nodes":["transpose"],"name":"Return_92"},{"class_name":"system_op","config":{"device_type":"kCPU","enable_cudnn":true,"name":"Return_91","return_conf":{"in":"Resnet-fc1001_bias_add/out_0","out":"out"},"scope_symbol_id":"4611686018427428862"},"inbound_nodes":["Resnet-fc1001_bias_add"],"name":"Return_91"},{"class_name":"system_op","config":{"device_type":"kCPU","enable_cudnn":true,"name":"Return_89","return_conf":{"in":"Softmax_87/out_0","out":"out"},"scope_symbol_id":"4611686018427420670"},"inbound_nodes":["Softmax_87"],"name":"Return_89"},{"class_name":"one_hot","config":{"depth":"1000","device_type":"kGPU","dtype":"kFloat","enable_cudnn":true,"floating_off_value":0.0001,"floating_on_value":0.9001,"integer_off_value":"0","integer_on_value":"0","name":"OneHot_86","scope_symbol_id":"4611686018427408382"},"inbound_nodes":["OFRecordRawDecoder_16"],"name":"OneHot_86"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"model_name":"bias","name":"Resnet-fc1001-bias","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["1000"],"trainable":true},"inbound_nodes":[],"name":"Resnet-fc1001-bias"},{"class_name":"matmul","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-fc1001_matmul","scope_symbol_id":"4611686018427412478","transpose_a":false,"transpose_b":true},"inbound_nodes":["Resnet-fc1001-weight","Resnet-Reshape_85"],"name":"Resnet-fc1001_matmul"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-fc1001-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["1000","2048"],"trainable":true},"inbound_nodes":[],"name":"Resnet-fc1001-weight"},{"class_name":"reshape","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Reshape_85","scope_symbol_id":"4611686018427412478","shape":["8","2048"]},"inbound_nodes":["Resnet-pool5"],"name":"Resnet-Reshape_85"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_2_branch2c_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["2048"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_2_branch2c_bn-gamma"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_2_branch2c_bn-beta","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["2048"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_2_branch2c_bn-beta"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_82","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res5_2_branch2b_bn"],"name":"Resnet-Relu_82"},{"class_name":"normalization","config":{"axis":1,"device_type":"kGPU","enable_cudnn":true,"epsilon":9.999999747378752e-06,"momentum":0.8999999761581421,"name":"Resnet-res5_2_branch2b_bn","scope_symbol_id":"4611686018427412478","training":true},"inbound_nodes":["Resnet-res5_2_branch2b_bn-moving_mean","Resnet-res5_2_branch2b_bn-gamma","Resnet-res5_2_branch2b_bn-beta","Resnet-res5_2_branch2b","Resnet-res5_2_branch2b_bn-moving_variance"],"name":"Resnet-res5_2_branch2b_bn"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res5_2_branch2b_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res5_2_branch2b_bn-moving_variance"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_2_branch2b_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res5_2_branch2b_bn-moving_mean"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res5_2_branch2b_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_2_branch2b_bn-gamma"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_2_branch2b_bn-beta","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_2_branch2b_bn-beta"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":512,"groups":1,"kernel_size":[3,3],"name":"Resnet-res5_2_branch2b","padding":"same","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res5_2_branch2b-weight","Resnet-Relu_81"],"name":"Resnet-res5_2_branch2b"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_81","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res5_2_branch2a_bn"],"name":"Resnet-Relu_81"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res5_2_branch2a_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res5_2_branch2a_bn-moving_variance"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_2_branch2a_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res5_2_branch2a_bn-moving_mean"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res5_2_branch2a_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_2_branch2a_bn-gamma"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_2_branch2a_bn-beta","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_2_branch2a_bn-beta"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res5_2_branch2a-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["512","2048","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_2_branch2a-weight"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_80","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-AddN_79"],"name":"Resnet-Relu_80"},{"class_name":"add_n","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-AddN_79","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-Relu_76","Resnet-res5_1_branch2c_bn"],"name":"Resnet-AddN_79"},{"class_name":"normalization","config":{"axis":1,"device_type":"kGPU","enable_cudnn":true,"epsilon":9.999999747378752e-06,"momentum":0.8999999761581421,"name":"Resnet-res5_1_branch2c_bn","scope_symbol_id":"4611686018427412478","training":true},"inbound_nodes":["Resnet-res5_1_branch2c_bn-gamma","Resnet-res5_1_branch2c_bn-moving_mean","Resnet-res5_1_branch2c_bn-beta","Resnet-res5_1_branch2c","Resnet-res5_1_branch2c_bn-moving_variance"],"name":"Resnet-res5_1_branch2c_bn"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_1_branch2c_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["2048"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res5_1_branch2c_bn-moving_mean"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_1_branch2c_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["2048"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_1_branch2c_bn-gamma"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_1_branch2c_bn-beta","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["2048"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_1_branch2c_bn-beta"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":2048,"groups":1,"kernel_size":[1,1],"name":"Resnet-res5_1_branch2c","padding":"valid","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res5_1_branch2c-weight","Resnet-Relu_78"],"name":"Resnet-res5_1_branch2c"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res5_1_branch2c-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["2048","512","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_1_branch2c-weight"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_78","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res5_1_branch2b_bn"],"name":"Resnet-Relu_78"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":512,"groups":1,"kernel_size":[1,1],"name":"Resnet-res3_3_branch2c","padding":"valid","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res3_3_branch2c-weight","Resnet-Relu_46"],"name":"Resnet-res3_3_branch2c"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":512,"groups":1,"kernel_size":[1,1],"name":"Resnet-res3_1_branch2c","padding":"valid","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res3_1_branch2c-weight","Resnet-Relu_38"],"name":"Resnet-res3_1_branch2c"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res2_0_branch2a_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["64"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res2_0_branch2a_bn-gamma"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_3_branch2b_bn-beta","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_3_branch2b_bn-beta"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res3_2_branch2b_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_2_branch2b_bn-gamma"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res4_2_branch2c_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["1024"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res4_2_branch2c_bn-moving_mean"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res3_3_branch2b-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128","128","3","3"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_3_branch2b-weight"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res3_3_branch2b_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_3_branch2b_bn-moving_variance"},{"class_name":"normalization","config":{"axis":1,"device_type":"kGPU","enable_cudnn":true,"epsilon":9.999999747378752e-06,"momentum":0.8999999761581421,"name":"Resnet-res3_3_branch2a_bn","scope_symbol_id":"4611686018427412478","training":true},"inbound_nodes":["Resnet-res3_3_branch2a_bn-gamma","Resnet-res3_3_branch2a_bn-moving_mean","Resnet-res3_3_branch2a_bn-beta","Resnet-res3_3_branch2a","Resnet-res3_3_branch2a_bn-moving_variance"],"name":"Resnet-res3_3_branch2a_bn"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res5_0_branch2a_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res5_0_branch2a_bn-moving_variance"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res3_3_branch2a_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_3_branch2a_bn-moving_variance"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_3_branch2a_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_3_branch2a_bn-moving_mean"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res3_0_branch2b-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128","128","3","3"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_0_branch2b-weight"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res5_1_branch2a_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res5_1_branch2a_bn-moving_variance"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":128,"groups":1,"kernel_size":[1,1],"name":"Resnet-res3_3_branch2a","padding":"valid","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res3_3_branch2a-weight","Resnet-Relu_44"],"name":"Resnet-res3_3_branch2a"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":256,"groups":1,"kernel_size":[1,1],"name":"Resnet-res2_0_branch1","padding":"valid","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res2_0_branch1-weight","Resnet-pool1"],"name":"Resnet-res2_0_branch1"},{"class_name":"normalization","config":{"axis":1,"device_type":"kGPU","enable_cudnn":true,"epsilon":9.999999747378752e-06,"momentum":0.8999999761581421,"name":"Resnet-res3_2_branch2c_bn","scope_symbol_id":"4611686018427412478","training":true},"inbound_nodes":["Resnet-res3_2_branch2c_bn-gamma","Resnet-res3_2_branch2c_bn-moving_mean","Resnet-res3_2_branch2c_bn-beta","Resnet-res3_2_branch2c","Resnet-res3_2_branch2c_bn-moving_variance"],"name":"Resnet-res3_2_branch2c_bn"},{"class_name":"ofrecord_raw_decoder","config":{"auto_zero_padding":false,"data_type":"5","device_type":"kCPU","dim1_varying_length":false,"enable_cudnn":true,"name":"class/label","scope_symbol_id":"4611686018427408382"},"inbound_nodes":["OFRecord_Reader_14"],"name":"OFRecordRawDecoder_16"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_2_branch2c_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_2_branch2c_bn-moving_variance"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res3_0_branch2b_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_0_branch2b_bn-moving_variance"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res5_0_branch1-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["2048","1024","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res5_0_branch1-weight"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":128,"groups":1,"kernel_size":[3,3],"name":"Resnet-res3_1_branch2b","padding":"same","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res3_1_branch2b-weight","Resnet-Relu_37"],"name":"Resnet-res3_1_branch2b"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_2_branch2c_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_2_branch2c_bn-gamma"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_2_branch2b_bn-beta","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_2_branch2b_bn-beta"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res3_2_branch2b-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128","128","3","3"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_2_branch2b-weight"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_41","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res3_2_branch2a_bn"],"name":"Resnet-Relu_41"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":64,"groups":1,"kernel_size":[1,1],"name":"Resnet-res2_1_branch2a","padding":"valid","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res2_1_branch2a-weight","Resnet-Relu_24"],"name":"Resnet-res2_1_branch2a"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_2_branch2a_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_2_branch2a_bn-moving_mean"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_1_branch2b_bn-beta","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_1_branch2b_bn-beta"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res4_4_branch2a_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["256"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res4_4_branch2a_bn-moving_mean"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res3_2_branch2a_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_2_branch2a_bn-gamma"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_54","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res4_1_branch2b_bn"],"name":"Resnet-Relu_54"},{"class_name":"normalization","config":{"axis":1,"device_type":"kGPU","enable_cudnn":true,"epsilon":9.999999747378752e-06,"momentum":0.8999999761581421,"name":"Resnet-res3_3_branch2b_bn","scope_symbol_id":"4611686018427412478","training":true},"inbound_nodes":["Resnet-res3_3_branch2b_bn-moving_mean","Resnet-res3_3_branch2b_bn-beta","Resnet-res3_3_branch2b","Resnet-res3_3_branch2b_bn-gamma","Resnet-res3_3_branch2b_bn-moving_variance"],"name":"Resnet-res3_3_branch2b_bn"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res4_5_branch2a_bn-beta","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["256"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res4_5_branch2a_bn-beta"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_1_branch2c_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_1_branch2c_bn-moving_variance"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res3_3_branch2c-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["512","128","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_3_branch2c-weight"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_1_branch2c_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_1_branch2c_bn-moving_mean"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_1_branch2c_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_1_branch2c_bn-gamma"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res4_1_branch2b_bn-beta","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["256"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res4_1_branch2b_bn-beta"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res4_5_branch2a-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["256","1024","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res4_5_branch2a-weight"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res2_0_branch2a_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["64"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res2_0_branch2a_bn-moving_variance"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res2_0_branch1_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["256"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res2_0_branch1_bn-moving_variance"},{"class_name":"system_op","config":{"device_type":"kCPU","enable_cudnn":true,"name":"Return_90","return_conf":{"in":"OFRecordRawDecoder_16/out_0","out":"out"},"scope_symbol_id":"4611686018427424766"},"inbound_nodes":["OFRecordRawDecoder_16"],"name":"Return_90"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res3_1_branch2c-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["512","128","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_1_branch2c-weight"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res3_1_branch2b_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_1_branch2b_bn-moving_variance"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res3_1_branch2b-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128","128","3","3"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_1_branch2b-weight"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_37","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res3_1_branch2a_bn"],"name":"Resnet-Relu_37"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res3_1_branch2a_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_1_branch2a_bn-gamma"},{"class_name":"add_n","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-AddN_59","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-Relu_56","Resnet-res4_2_branch2c_bn"],"name":"Resnet-AddN_59"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res3_1_branch2a_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_1_branch2a_bn-moving_variance"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res3_1_branch2a-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128","512","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_1_branch2a-weight"},{"class_name":"normalization","config":{"axis":1,"device_type":"kGPU","enable_cudnn":true,"epsilon":9.999999747378752e-06,"momentum":0.8999999761581421,"name":"Resnet-res2_1_branch2a_bn","scope_symbol_id":"4611686018427412478","training":true},"inbound_nodes":["Resnet-res2_1_branch2a_bn-gamma","Resnet-res2_1_branch2a_bn-moving_mean","Resnet-res2_1_branch2a_bn-beta","Resnet-res2_1_branch2a","Resnet-res2_1_branch2a_bn-moving_variance"],"name":"Resnet-res2_1_branch2a_bn"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res3_3_branch2a-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128","512","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_3_branch2a-weight"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":128,"groups":1,"kernel_size":[1,1],"name":"Resnet-res3_2_branch2a","padding":"valid","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res3_2_branch2a-weight","Resnet-Relu_40"],"name":"Resnet-res3_2_branch2a"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res2_0_branch2c-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["256","64","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res2_0_branch2c-weight"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_36","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-AddN_35"],"name":"Resnet-Relu_36"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_0_branch1_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_0_branch1_bn-moving_mean"},{"class_name":"add_n","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-AddN_83","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-Relu_80","Resnet-res5_2_branch2c_bn"],"name":"Resnet-AddN_83"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res3_1_branch2b_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res3_1_branch2b_bn-moving_mean"},{"class_name":"normalization","config":{"axis":1,"device_type":"kGPU","enable_cudnn":true,"epsilon":9.999999747378752e-06,"momentum":0.8999999761581421,"name":"Resnet-res3_0_branch2c_bn","scope_symbol_id":"4611686018427412478","training":true},"inbound_nodes":["Resnet-res3_0_branch2c_bn-gamma","Resnet-res3_0_branch2c_bn-moving_mean","Resnet-res3_0_branch2c_bn-beta","Resnet-res3_0_branch2c","Resnet-res3_0_branch2c_bn-moving_variance"],"name":"Resnet-res3_0_branch2c_bn"},{"class_name":"add_n","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-AddN_27","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-Relu_24","Resnet-res2_1_branch2c_bn"],"name":"Resnet-AddN_27"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res3_1_branch2b_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_1_branch2b_bn-gamma"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res2_0_branch2a_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["64"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res2_0_branch2a_bn-moving_mean"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":512,"groups":1,"kernel_size":[1,1],"name":"Resnet-res3_0_branch2c","padding":"valid","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res3_0_branch2c-weight","Resnet-Relu_34"],"name":"Resnet-res3_0_branch2c"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res3_0_branch2c-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["512","128","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_0_branch2c-weight"},{"class_name":"normalization","config":{"axis":1,"device_type":"kGPU","enable_cudnn":true,"epsilon":9.999999747378752e-06,"momentum":0.8999999761581421,"name":"Resnet-res3_0_branch2b_bn","scope_symbol_id":"4611686018427412478","training":true},"inbound_nodes":["Resnet-res3_0_branch2b_bn-gamma","Resnet-res3_0_branch2b_bn-beta","Resnet-res3_0_branch2b_bn-moving_mean","Resnet-res3_0_branch2b","Resnet-res3_0_branch2b_bn-moving_variance"],"name":"Resnet-res3_0_branch2b_bn"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":1024,"groups":1,"kernel_size":[1,1],"name":"Resnet-res4_5_branch2c","padding":"valid","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res4_5_branch2c-weight","Resnet-Relu_70"],"name":"Resnet-res4_5_branch2c"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_1_branch2c_bn-moving_variance","out":"out","scope_symbol_id":"4611686018427412478","shape":["2048"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res5_1_branch2c_bn-moving_variance"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_34","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res3_0_branch2b_bn"],"name":"Resnet-Relu_34"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_26","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res2_1_branch2b_bn"],"name":"Resnet-Relu_26"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_44","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-AddN_43"],"name":"Resnet-Relu_44"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":128,"groups":1,"kernel_size":[3,3],"name":"Resnet-res3_0_branch2b","padding":"same","scope_symbol_id":"4611686018427412478","strides":[2,2]},"inbound_nodes":["Resnet-res3_0_branch2b-weight","Resnet-Relu_33"],"name":"Resnet-res3_0_branch2b"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_50","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res4_0_branch2b_bn"],"name":"Resnet-Relu_50"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res2_2_branch2b_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["64"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res2_2_branch2b_bn-moving_mean"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res4_1_branch2a-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["256","1024","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res4_1_branch2a-weight"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res4_5_branch2c_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["1024"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res4_5_branch2c_bn-gamma"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_53","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res4_1_branch2a_bn"],"name":"Resnet-Relu_53"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_38","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res3_1_branch2b_bn"],"name":"Resnet-Relu_38"},{"class_name":"relu","config":{"device_type":"kGPU","enable_cudnn":true,"name":"Resnet-Relu_33","scope_symbol_id":"4611686018427412478"},"inbound_nodes":["Resnet-res3_0_branch2a_bn"],"name":"Resnet-Relu_33"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":0.0}},"name":"Resnet-res5_0_branch2b_bn-moving_mean","out":"out","scope_symbol_id":"4611686018427412478","shape":["512"],"trainable":false},"inbound_nodes":[],"name":"Resnet-res5_0_branch2b_bn-moving_mean"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"constant_conf":{"value":1.0}},"name":"Resnet-res3_0_branch2a_bn-gamma","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["128"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res3_0_branch2a_bn-gamma"},{"class_name":"conv2d","config":{"data_format":"channels_first","device_type":"kGPU","dilation_rate":[1,1],"enable_cudnn":true,"filters":128,"groups":1,"kernel_size":[1,1],"name":"Resnet-res3_0_branch2a","padding":"valid","scope_symbol_id":"4611686018427412478","strides":[1,1]},"inbound_nodes":["Resnet-res3_0_branch2a-weight","Resnet-Relu_32"],"name":"Resnet-res3_0_branch2a"},{"class_name":"variable","config":{"data_type":"kFloat","device_type":"kGPU","enable_cudnn":true,"initializer":{"variance_scaling_conf":{"data_format":"channels_first","distribution":"kRandomNormal","scale":2.0,"variance_norm":"kFanIn"}},"model_name":"weight","name":"Resnet-res2_2_branch2a-weight","out":"out","regularizer":{"l1_l2_conf":{"l1":0.0,"l2":3.0517578125e-05}},"scope_symbol_id":"4611686018427412478","shape":["64","256","1","1"],"trainable":true},"inbound_nodes":[],"name":"Resnet-res2_2_branch2a-weight"},